In [1]:
import pandas as pd

In [2]:
data=pd.read_csv('papsolv.csv')
print(data)

        Name  Maths  Chemistry  Physics  Geography
0       John     45       60.0      NaN       70.0
1       Mary     80       75.0     65.0       90.0
2       Jack     85       80.0     90.0        NaN
3       Jill     70        NaN     80.0       75.0
4       John     45       60.0      NaN       70.0
5       Mary     80       75.0     65.0       90.0
6       Jack     85       80.0     90.0        NaN
7       Jill     70        NaN     80.0       75.0
8      Sarah     50       55.0      NaN       80.0
9        Sam     60       70.0     75.0       85.0
10     David     75       80.0     85.0        NaN
11  Samantha     90        NaN     70.0       75.0
12     Sarah     50       55.0      NaN       80.0
13       Sam     60       70.0     75.0       85.0
14     David     75       80.0     85.0        NaN
15  Samantha     90        NaN     70.0       75.0
16      Alex     55       65.0     75.0       80.0
17     Katie     70       75.0     80.0       85.0
18      Alex     55       65.0     75.0       80.0
19     Katie     70       75.0     80.0       85.0

In [3]:
#finding MEAN of all

chem_mean=data['Chemistry'].mean()
phy_mean=data['Physics'].mean()
geo_mean=data['Geography'].mean()
data['Chemistry']=data['Chemistry'].fillna(chem_mean)
data['Physics']=data['Physics'].fillna(phy_mean)
data['Geography']=data['Geography'].fillna(geo_mean)
print(data)

        Name  Maths  Chemistry  Physics  Geography
0       John     45       60.0     77.5       70.0
1       Mary     80       75.0     65.0       90.0
2       Jack     85       80.0     90.0       80.0
3       Jill     70       70.0     80.0       75.0
4       John     45       60.0     77.5       70.0
5       Mary     80       75.0     65.0       90.0
6       Jack     85       80.0     90.0       80.0
7       Jill     70       70.0     80.0       75.0
8      Sarah     50       55.0     77.5       80.0
9        Sam     60       70.0     75.0       85.0
10     David     75       80.0     85.0       80.0
11  Samantha     90       70.0     70.0       75.0
12     Sarah     50       55.0     77.5       80.0
13       Sam     60       70.0     75.0       85.0
14     David     75       80.0     85.0       80.0
15  Samantha     90       70.0     70.0       75.0
16      Alex     55       65.0     75.0       80.0
17     Katie     70       75.0     80.0       85.0
18      Alex     55       65.0     75.0       80.0
19     Katie     70       75.0     80.0       85.0

In [4]:
print(chem_mean)

70.0

In [5]:
chem_median=data['Chemistry'].median()
print(chem_median)

70.0

In [6]:
chem_mode=data['Chemistry'].mode()
print(chem_mode)

0    70.0
Name: Chemistry, dtype: float64

In [7]:
std_dev = np.std(data)

NameError: name 'np' is not defined

In [8]:
import numpy as np

In [9]:
std_dev = np.std(data)

C:\Users\Aman Pathan\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3579: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  return std(axis=axis, dtype=dtype, out=out, ddof=ddof, **kwargs)

In [10]:
print("Print first 5 records")
data.head()

Print first 5 records

   Name  Maths  Chemistry  Physics  Geography
0  John     45       60.0     77.5       70.0
1  Mary     80       75.0     65.0       90.0
2  Jack     85       80.0     90.0       80.0
3  Jill     70       70.0     80.0       75.0
4  John     45       60.0     77.5       70.0

In [11]:
print("Print Last 5 records")
data.tail()

Print Last 5 records

        Name  Maths  Chemistry  Physics  Geography
15  Samantha     90       70.0     70.0       75.0
16      Alex     55       65.0     75.0       80.0
17     Katie     70       75.0     80.0       85.0
18      Alex     55       65.0     75.0       80.0
19     Katie     70       75.0     80.0       85.0

In [12]:
print("data types of each Columns")
data.dtypes

data types of each Columns

Name          object
Maths          int64
Chemistry    float64
Physics      float64
Geography    float64
dtype: object

In [13]:
print("Count non-null value of each columns")
data.count()

Count non-null value of each columns

Name         20
Maths        20
Chemistry    20
Physics      20
Geography    20
dtype: int64

In [14]:
print(data.isnull())

     Name  Maths  Chemistry  Physics  Geography
0   False  False      False    False      False
1   False  False      False    False      False
2   False  False      False    False      False
3   False  False      False    False      False
4   False  False      False    False      False
5   False  False      False    False      False
6   False  False      False    False      False
7   False  False      False    False      False
8   False  False      False    False      False
9   False  False      False    False      False
10  False  False      False    False      False
11  False  False      False    False      False
12  False  False      False    False      False
13  False  False      False    False      False
14  False  False      False    False      False
15  False  False      False    False      False
16  False  False      False    False      False
17  False  False      False    False      False
18  False  False      False    False      False
19  False  False      False    False      False

In [15]:
data=data.drop('Maths',axis=1)
print(data)

        Name  Chemistry  Physics  Geography
0       John       60.0     77.5       70.0
1       Mary       75.0     65.0       90.0
2       Jack       80.0     90.0       80.0
3       Jill       70.0     80.0       75.0
4       John       60.0     77.5       70.0
5       Mary       75.0     65.0       90.0
6       Jack       80.0     90.0       80.0
7       Jill       70.0     80.0       75.0
8      Sarah       55.0     77.5       80.0
9        Sam       70.0     75.0       85.0
10     David       80.0     85.0       80.0
11  Samantha       70.0     70.0       75.0
12     Sarah       55.0     77.5       80.0
13       Sam       70.0     75.0       85.0
14     David       80.0     85.0       80.0
15  Samantha       70.0     70.0       75.0
16      Alex       65.0     75.0       80.0
17     Katie       75.0     80.0       85.0
18      Alex       65.0     75.0       80.0
19     Katie       75.0     80.0       85.0

In [16]:
data.insert(1, 'inserted', 0)
print (data)

        Name  inserted  Chemistry  Physics  Geography
0       John         0       60.0     77.5       70.0
1       Mary         0       75.0     65.0       90.0
2       Jack         0       80.0     90.0       80.0
3       Jill         0       70.0     80.0       75.0
4       John         0       60.0     77.5       70.0
5       Mary         0       75.0     65.0       90.0
6       Jack         0       80.0     90.0       80.0
7       Jill         0       70.0     80.0       75.0
8      Sarah         0       55.0     77.5       80.0
9        Sam         0       70.0     75.0       85.0
10     David         0       80.0     85.0       80.0
11  Samantha         0       70.0     70.0       75.0
12     Sarah         0       55.0     77.5       80.0
13       Sam         0       70.0     75.0       85.0
14     David         0       80.0     85.0       80.0
15  Samantha         0       70.0     70.0       75.0
16      Alex         0       65.0     75.0       80.0
17     Katie         0       75.0     80.0       85.0
18      Alex         0       65.0     75.0       80.0
19     Katie         0       75.0     80.0       85.0